import pandas as pd

dates = ['', '오늘', '내일', '이번주', '다음주']

locations = ['서울', '인천', '부산', '대구', '광주', '울산', '대전', '광명', '파주', '창원', '평택',
             '제주도', '전주', '용인', '수원', '청주', '안산', '시흥', '춘천', '목포', '경주', '강남구', '강동구', '강북구', '강서구', '관악구', '광진구', '구로구', '금천구', '노원구', '도봉구', '동대문구', '동작구', '마포구', '미지정', '서대문구', '서초구', '성동구', '성북구', '송파구', '양천구', '영등포구', '용산구', '은평구', '종로구', '중구', '중랑구',
             '서구', '동구', '영도구', '부산진구', '동래구', '남구', '북구', '해운대구', '사하구', '금정구', '연제구', '수영구', '사상구', '기장군',
             '미추홀구', '연수구', '남동구', '부평구', '계양구', '수성구', '달서구', '홍대', '건대', '신촌', '이태원', '강남역', '신논현역', '가로수길']

end1 = ['어때', '어떠니', '알려줘', '알려주세요']
end2 = ['맑니', '맑을까', '덥니', '더울까', '춥니', '추울까',
        '흐리니', '흐릴까', '비오니', '비올까', '눈오니', '눈올까']
end3 = ['필요해', '필요하니', '필요할까', '챙길까', '쓸까']


def makeExel(items, col, path):
    result = []

    for item in items:
        result.append([item] + [col])

    data = pd.DataFrame(result, columns=('question', 'intent'))
    data.to_csv(path, encoding='cp949', mode='a', index=False)
    # data.to_csv(path, encoding='ms949', mode='w')

################################################ 날씨 ################################################
# 지역 날씨 어때/어떠니/알려줘/알려주세요
# 오늘 지역 날씨 어때/어떠니/알려줘/알려주세요
# 내일 지역 날씨 어때/어떠니/알려줘/알려주세요
# 이번주 지역 날씨 어때/어떠니/알려줘/알려주세요
# 다음주 지역 날씨 어때/어떠니/알려줘/알려주세요

# 지역 맑니/맑을까/덥니/더울까/춥니/추울까/흐리니/흐릴까/비오니/비올까/눈오니/눈올까
# 오늘 지역 맑니/맑을까/덥니/더울까/춥니/추울까/흐리니/흐릴까/비오니/비올까/눈오니/눈올까
# 내일 지역 맑니/맑을까/덥니/더울까/춥니/추울까/흐리니/흐릴까/비오니/비올까/눈오니/눈올까
# 이번주 지역 맑니/맑을까/덥니/더울까/춥니/추울까/흐리니/흐릴까/비오니/비올까/눈오니/눈올까
# 다음주 지역 맑니/맑을까/덥니/더울까/춥니/추울까/흐리니/흐릴까/비오니/비올까/눈오니/눈올까


# 지역 우산 필요해/필요하니/필요할까/챙길까
# 오늘 지역 우산 필요해/필요하니/필요할까/챙길까
# 내일 지역 우산 필요해/필요하니/필요할까/챙길까
# 이번주 지역 우산 필요해/필요하니/필요할까/챙길까
# 다음주 지역 우산 필요해/필요하니/필요할까/챙길까
#####################################################################################################
dusts = ['먼지', '먼지 상태', '미세먼지', '미세먼지 상태', '공기', '공기 상태', '먼지 수치', '미세먼지 수치']
################################################ 먼지 ################################################
# 지역 먼지/미세먼지/공기/먼지수치/미세먼지 수치/ 어때/어떠니/알려줘/알려주세요
# 오늘 지역 먼지/미세먼지/공기/먼지수치/미세먼지 수치/ 어때/어떠니/알려줘/알려주세요
# 내일 지역 먼지/미세먼지/공기/먼지수치/미세먼지 수치/ 어때/어떠니/알려줘/알려주세요
# 이번주 지역 먼지/미세먼지/공기/먼지수치/미세먼지 수치/ 어때/어떠니/알려줘/알려주세요
# 다음주 지역 먼지/미세먼지/공기/먼지수치/미세먼지 수치/ 어때/어떠니/알려줘/알려주세요

# 지역 마스크 필요해/필요하니/필요할까/챙길까
# 오늘 지역 마스크 필요해/필요하니/필요할까/챙길까
# 내일 지역 마스크 필요해/필요하니/필요할까/챙길까
# 이번주 지역 마스크 필요해/필요하니/필요할까/챙길까
# 다음주 지역 마스크 필요해/필요하니/필요할까/챙길까
#####################################################################################################


weather = []
for date in dates:
    for location in locations:
        for i in end1:
            weather.append(date+' '+location+' '+'날씨'+' '+i)

for date in dates:
    for location in locations:
        for i in end2:
            weather.append(date+' '+location+' '+i)

for date in dates:
    for location in locations:
        for i in end3:
            weather.append(date+' '+location+' '+'우산'+' '+i)


dust = []
for date in dates:
    for location in locations:
        for d in dusts:
            for i in end1:
                dust.append(date+' '+location+' '+d+' '+i)

for date in dates:
    for location in locations:
        for i in end3:
            dust.append(date+' '+location+' '+'마스크'+' '+i)
################################################ 저장 ################################################

makeExel(weather, '날씨', 'intent_dataset.csv')
makeExel(dust, '먼지', 'intent_dataset.csv')
