###########################################################################
## test1.py 테스트

test = [6, 3, 2, 1, 1, 7]
N = 328

# 이진수로 변환
binary = format(N, 'b') # 바이너리 타입으로 변경
print(binary)
print(binary.strip('0'))    # 앞,뒤 제거
print(binary.strip('0').split('1'), end="\n\n") # 분리

print(len(max(format(N, 'b').strip('0').split('1'))))


###########################################################################
print('\n\n############################################')
test2 = [9,3,9,3,9,7,9]

x = 0

for number in test2:
    x ^= number
    print(x)


###########################################################################
print('\n\n############################################')
# 비트 논리 연산(XOR)

print(3 ^ 3) # >> 0
print(1 ^ 2)
print(2 ^ 3)
print(3 ^ 5) # >> 6
# 0011
# 0101
# 0110

check = 0
check ^= 3 ^ 5
# 0011
# 0101
# 0110
print(check)